<?php 
/* 
التكليف 01

    قم بحساب المساحة الكلية لجميع ال Drives الموجودة في جهازك ولو كانوا كثير يكفي أول إثنين فقط
    يجب طباعة المساحة بالتيرابايت شاهد المثال لترى المطلوب
    يجب أن يكون هناك رقمين فقط بعد العلامة العشرية

// Output Examples
"1.37 Terabyte"
"0.46 Terabyte"

=============================================================
*/

echo round( (disk_total_space("c://") / 1024 /1024 /1024 / 1024 ) , 2 ) ." Terabyte <br>";
echo round( (disk_total_space("c://") / 1024 /1024 /1024 / 1024 ) , 2 ) ." Terabyte <br>";
  