<?php 
/* 

التكليف 10 تحدي

    لديك مجموعة من المتغيرات التي تساعدك في عمل المطلوب
    المطلوب طباعة الارقام بالترتيب
    بعد كل رقم تقوم بجمع هذا الرقم مع الرقم الموازي له من الجهة الأخرى
    بمعنى أول رقم مع آخر رقم وثاني رقم مع الرقم قبل الأخير وثالث رقم مع ثالث رقم ورابع رقم مع ثاني رقم وآخر رقم مع أول رقم
    ممنوع إستعمال أي أرقام نهائيا
    يجب إستخدام ال Loop Foreach
    شاهد المثال لتعرف المطلوب

$help_num = 4;
$nums = [2, 4, 5, 6, 10];

// Output
"2 + 10 = 12"
"4 + 6 = 10"
"5 + 5 = 10"
"6 + 4 = 10"
"10 + 2 = 12"

*/

$help_num = 4;
$nums = [2, 4, 5, 6, 10];

foreach ($nums as $index => $value) {
   echo " $value  +  ". $nums[$help_num -$index] . "  = " .   ($value  +   $nums[$help_num -$index]) . "<br>" ;
}