<?php 


/* 
    التكليف 04

    ممنوع إستخدام الأرقام نهائيا ويمكنك إستخدام قيم المتغيرات مع ما تعلمته لتنفيذ المطلوب
    يجب طباعة الأرقام كما في المثال والتوقف عند الرقم 3
    إذا كان الرقم اصغر من 10 قم بطباعة صفر قبله
    يجب إستخدام ال Loop For لعمل المطلوب

$start = 10;
$end = 0;
$stop = 3;

// Needed Output
10
09
08
07
06
05
04
03

*/
$start = 10;
$end = 0;
$stop = 3;

for($i = $start ; $i > $end ; $i--){
    if($i < $stop) break ;
    if($i<$start){
        echo "0$i <br>" ;
    }else{
        echo $i ."<br>" ;
    }
}





